export const PREPOSITIONS = new Set([
  "в", "на", "с", "к", "о", "об", "от", "до", "за", "для", "по", "при", "через", "между", "над", "под", "про", "без", "у", "из", "около", "вне", "внутри", "вместо", "сверх", "впереди", "вслед", "по-за", "в течение",
  "не", "ни",
  "и", "а", "но", "да", "или", "либо", "чтобы", "что", "как", "когда", "если", "поскольку", "так как", "хотя", "зато", "ли", "ведь", "ибо", "пусть", "даже", "только", "однако", "также", "несмотря", "пока", "потому что", "чем", "чтобы", "лишь", "ибо"
]);